Revit 2027 API
SolidGlass.SolidglassColorByObject Property
 The property labeled "Custom Color" from the "SolidGlass" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string SolidglassColorByObject { get; }
Public Shared ReadOnly Property SolidglassColorByObject As String
	Get
public:
static property String^ SolidglassColorByObject {
	String^ get ();
}
static member SolidglassColorByObject : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyBoolean".
See Also
Reference
SolidGlass Class
Autodesk.Revit.DB.Visual Namespace